In [1]:
import pandas as pd
import numpy as np

In [2]:
#loading the dataset
df = pd.read_excel("C:\\Users\\14375\\Downloads\\sql project data\\CUSTOMER DIMENSION.xlsx" ,skiprows=3, header=1)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer id  94 non-null     object
 1   Unnamed: 1   0 non-null      float64
 2   Name         94 non-null     object
 3   Location     94 non-null     object
 4   Column1      0 non-null      float64
 5   Age          87 non-null     float64
 6   Gender       94 non-null     object
dtypes: float64(3), object(4)
memory usage: 5.5+ KB

In [4]:
df.describe()

       Unnamed: 1  Column1        Age
count         0.0      0.0  87.000000
mean          NaN      NaN  28.850575
std           NaN      NaN   6.535287
min           NaN      NaN  18.000000
25%           NaN      NaN  24.000000
50%           NaN      NaN  28.000000
75%           NaN      NaN  33.000000
max           NaN      NaN  44.000000

In [5]:
df.shape

(99, 7)

In [6]:
df.head(5)

  customer id  Unnamed: 1    Name   Location  Column1   Age  Gender
0       CI001         NaN   Aarav      Delhi      NaN  28.0    Male
1       CI002         NaN   Aarya  Bengaluru      NaN  31.0  Female
2       CI003         NaN  Aashna     Jaipur      NaN  36.0  Female
3       CI004         NaN  Aastha    Lucknow      NaN  24.0  Female
4       CI005         NaN   Abhay    Chennai      NaN  33.0    Male

In [7]:
df.dropna(how='all', inplace=True)

In [8]:
df.dropna(axis=1, how='all', inplace=True)

In [9]:
df.columns

Index(['customer id', 'Name', 'Location', 'Age', 'Gender'], dtype='object')

In [10]:
df = df.rename(columns={'customer id': 'Customer id'})

In [11]:
print(df)

   Customer id    Name   Location   Age  Gender
0        CI001   Aarav      Delhi  28.0    Male
1        CI002   Aarya  Bengaluru  31.0  Female
2        CI003  Aashna     Jaipur  36.0  Female
3        CI004  Aastha    Lucknow  24.0  Female
4        CI005   Abhay    Chennai  33.0    Male
..         ...     ...        ...   ...     ...
94       CI090   Mansi  Ahmedabad  30.0  Female
95       CI091  Mayank      Delhi  25.0    Male
96       CI092   Meera  Bengaluru  33.0  Female
97       CI093    Meha    Chennai  21.0  Female
98       CI094   Mohak  Hyderabad  24.0    Male

[94 rows x 5 columns]

In [12]:
print(df)

   Customer id    Name   Location   Age  Gender
0        CI001   Aarav      Delhi  28.0    Male
1        CI002   Aarya  Bengaluru  31.0  Female
2        CI003  Aashna     Jaipur  36.0  Female
3        CI004  Aastha    Lucknow  24.0  Female
4        CI005   Abhay    Chennai  33.0    Male
..         ...     ...        ...   ...     ...
94       CI090   Mansi  Ahmedabad  30.0  Female
95       CI091  Mayank      Delhi  25.0    Male
96       CI092   Meera  Bengaluru  33.0  Female
97       CI093    Meha    Chennai  21.0  Female
98       CI094   Mohak  Hyderabad  24.0    Male

[94 rows x 5 columns]

In [13]:
print(df.isnull().sum())

Customer id    0
Name           0
Location       0
Age            7
Gender         0
dtype: int64

In [14]:

df['Age'] = df['Age'].fillna(df['Age'].mean())

In [15]:
print(df)

   Customer id    Name   Location   Age  Gender
0        CI001   Aarav      Delhi  28.0    Male
1        CI002   Aarya  Bengaluru  31.0  Female
2        CI003  Aashna     Jaipur  36.0  Female
3        CI004  Aastha    Lucknow  24.0  Female
4        CI005   Abhay    Chennai  33.0    Male
..         ...     ...        ...   ...     ...
94       CI090   Mansi  Ahmedabad  30.0  Female
95       CI091  Mayank      Delhi  25.0    Male
96       CI092   Meera  Bengaluru  33.0  Female
97       CI093    Meha    Chennai  21.0  Female
98       CI094   Mohak  Hyderabad  24.0    Male

[94 rows x 5 columns]

In [16]:
df.to_excel("C:\\Users\\14375\\Downloads\\sql project data\\CUSTOMER_dIM_clean.xlsx", index=False)